wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_edim_hdsl.c
}

/*!
    \brief      get fast position (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     fast position: 0~0xFFFFFFFFFFFFFFFF
*/
uint64_t edim_hdsl_position_read(void)
{
    uint64_t pos;
    pos = EDIM_HDSL_POS4;
    pos = EDIM_HDSL_POS3 | (pos << 8);
    pos = EDIM_HDSL_POS2 | (pos << 8);
    pos = EDIM_HDSL_POS1 | (pos << 8);
    pos = EDIM_HDSL_POS0 | (pos << 8);
    return pos;
}

/*!
    \brief      get safe position (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     safe position: 0~0xFFFFFFFFFFFFFFFF
*/
uint64_t edim_hdsl_vposition_read(void)
{
    uint64_t vpos;
    vpos = EDIM_HDSL_VPOS4;
    vpos = EDIM_HDSL_VPOS3 | (vpos << 8);
    vpos = EDIM_HDSL_VPOS2 | (vpos << 8);
    vpos = EDIM_HDSL_VPOS1 | (vpos << 8);
    vpos = EDIM_HDSL_VPOS0 | (vpos << 8);
    return vpos;
}

/*!
    \brief      get safe position value from safe channel 2 (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     safe position: 0~0xFFFFFFFFFFFFFFFF
*/
uint64_t edim_hdsl_vposition2_read(void)
{
    uint64_t vpos;
    vpos = EDIM_HDSL_VPOS24;
    vpos = EDIM_HDSL_VPOS23 | (vpos << 8);
    vpos = EDIM_HDSL_VPOS22 | (vpos << 8);
    vpos = EDIM_HDSL_VPOS21 | (vpos << 8);
    vpos = EDIM_HDSL_VPOS20 | (vpos << 8);
    return vpos;
}

/*!
    \brief      get speed (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     speed: 0~0xFFFFFF
*/
uint32_t edim_hdsl_speed_read(void)
{
    uint32_t vel;
    vel = EDIM_HDSL_VEL2;
    vel = EDIM_HDSL_VEL1 | (vel << 8);
    vel = EDIM_HDSL_VEL0 | (vel << 8);
    return vel;
}

/*!
    \brief      get mirror status summary flag (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     Status summary flag: 0~0xFF
*/
uint8_t edim_hdsl_mirror_status_sum_flag_get(void)
{
    return EDIM_HDSL_MIR_SUM;
}

/*!
    \brief      write paramaeter channel buffer (API_ID(0x0015U))
    \param[in]  data: parameter channel buffer to be sent,8 bytes
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_write(uint64_t data)
{
    EDIM_HDSL_PC_BUFFER0 = (uint8_t)data;
    EDIM_HDSL_PC_BUFFER1 = (uint8_t)(data >> 8);
    EDIM_HDSL_PC_BUFFER2 = (uint8_t)(data >> 16);
    EDIM_HDSL_PC_BUFFER3 = (uint8_t)(data >> 24);
    EDIM_HDSL_PC_BUFFER4 = (uint8_t)(data >> 32);
    EDIM_HDSL_PC_BUFFER5 = (uint8_t)(data >> 40);
    EDIM_HDSL_PC_BUFFER6 = (uint8_t)(data >> 48);
    EDIM_HDSL_PC_BUFFER7 = (uint8_t)(data >> 56);
}

/*!
    \brief      read the answer to a long meesage in paramaeter channel buffer (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     answer to a long message: 0~0xFFFFFFFFFFFFFFFF
*/
uint64_t edim_hdsl_long_message_read(void)
{
    uint64_t data;
    data = EDIM_HDSL_PC_BUFFER7;
    data = EDIM_HDSL_PC_BUFFER6 | (data << 8);
    data = EDIM_HDSL_PC_BUFFER5 | (data << 8);
    data = EDIM_HDSL_PC_BUFFER4 | (data << 8);
    data = EDIM_HDSL_PC_BUFFER3 | (data << 8);
    data = EDIM_HDSL_PC_BUFFER2 | (data << 8);
    data = EDIM_HDSL_PC_BUFFER1 | (data << 8);
    data = EDIM_HDSL_PC_BUFFER0 | (data << 8);
    return data;
}

/*!
    \brief      read errors in encoder resources arising from the previous "long message" operation (API_ID(0x0017U))
    \param[in]  none
    \param[out] none
    \retval     long message errors: 0~0xFFFF
*/
uint16_t edim_hdsl_long_message_error_read(void)
{
    uint16_t data;
    data = (uint16_t)EDIM_HDSL_PC_BUFFER1;
    data = (uint16_t)EDIM_HDSL_PC_BUFFER0 | ((uint16_t)(data << 8));
    return data;
}

/*!
    \brief      initialize EDIM_HDSL long message address struct with a default value (API_ID(0x0018U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_addr_init_struct_para_init(edim_hdsl_long_msg_addr_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(EDIM_HDSL_MODULE_ID, API_ID(0x0018U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        initpara->direction = EDIM_HDSL_LONG_MSG_WRITE;
        initpara->d_i_mode = EDIM_HDSL_LONG_MSG_DIRECT;
        initpara->laddh = 0U;
        initpara->laddl = 0U;
        initpara->ladd_off_h = 0U;
        initpara->ladd_off_l = 0U;
        initpara->len = (uint8_t)EDIM_HDSL_LONG_MSG_LEN_0;
        initpara->offset = EDIM_HDSL_LONG_MSG_WITHOUT_OFFSET;
    }
}

/*!
    \brief      long message send address initialization (API_ID(0x0019U))
    \param[in]  msg_addr_struct: the data needed to be send
                  direction: EDIM_HDSL_LONG_MSG_WRITE, EDIM_HDSL_LONG_MSG_READ
                  offset: EDIM_HDSL_LONG_MSG_WITHOUT_OFFSET, EDIM_HDSL_LONG_MSG_OFFSET
                  d_i_mode: EDIM_HDSL_LONG_MSG_DIRECT, EDIM_HDSL_LONG_MSG_INDIRECT
                  len: EDIM_HDSL_LONG_MSG_LEN_0, EDIM_HDSL_LONG_MSG_LEN_2, EDIM_HDSL_LONG_MSG_LEN_4, EDIM_HDSL_LONG_MSG_LEN_8
                  laddh: long message address, bit 9 to bit 8
                  laddl: long message address, bit 7 to bit 0
                  ladd_off_l: long message offset value, bit 7 to bit 0
                  ladd_off_h: long message offset value, bit 14 to bit 8
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_addr_init(edim_hdsl_long_msg_addr_struct *msg_addr_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(msg_addr_struct)) {
        fw_debug_report_err(EDIM_HDSL_MODULE_ID, API_ID(0x0019U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure long message send address */
        EDIM_HDSL_PC_ADD_H &= (uint8_t)(~(EDIM_HDSL_PC_ADD_H_LADDH | EDIM_HDSL_PC_ADD_H_LLEN | EDIM_HDSL_PC_ADD_H_LIND | EDIM_HDSL_PC_ADD_H_LOFF |
                             EDIM_HDSL_PC_ADD_H_LRW));
        EDIM_HDSL_PC_ADD_H |= (uint8_t)((msg_addr_struct->direction & EDIM_HDSL_PC_ADD_H_LRW) | (msg_addr_struct->d_i_mode & EDIM_HDSL_PC_ADD_H_LIND) |
                           (msg_addr_struct->len & EDIM_HDSL_PC_ADD_H_LLEN) | (msg_addr_struct->offset & EDIM_HDSL_PC_ADD_H_LOFF) |
                           (msg_addr_struct->laddh & EDIM_HDSL_PC_ADD_H_LADDH));
        EDIM_HDSL_PC_ADD_L = msg_addr_struct->laddl;
        EDIM_HDSL_PC_OFF_H = (msg_addr_struct->ladd_off_h | 0x80U);
        EDIM_HDSL_PC_OFF_L = msg_addr_struct->ladd_off_l;
    }
}

/*!
    \brief      long message error flag get (API_ID(0x001AU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_long_message_error_flag_get(void)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_PC_ADD_H & EDIM_HDSL_PC_ADD_H_LOFF)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      configure long message addressing offset mode (API_ID(0x001BU))
    \param[in]  mode: long message addressing offset mode
                EDIM_HDSL_LONG_MSG_WITHOUT_OFFSET: long message addressing without offset
                EDIM_HDSL_LONG_MSG_OFFSET: long message addressing with offset
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_addr_offset_mode_config(uint8_t mode)
{
    if(EDIM_HDSL_LONG_MSG_WITHOUT_OFFSET == mode) {
        EDIM_HDSL_PC_ADD_H &= (uint8_t)(~EDIM_HDSL_PC_ADD_H_LOFF);
    } else if(EDIM_HDSL_LONG_MSG_OFFSET == mode) {
        EDIM_HDSL_PC_ADD_H |= (uint8_t)(EDIM_HDSL_PC_ADD_H_LOFF);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure long message read / write mode (API_ID(0x001CU))
    \param[in]  mode: long message read / write mode
                EDIM_HDSL_LONG_MSG_WRITE: long message write mode
                EDIM_HDSL_LONG_MSG_READ: long message read mode
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_read_write_mode_config(uint8_t mode)
{
    if(EDIM_HDSL_LONG_MSG_WRITE == mode) {
        EDIM_HDSL_PC_ADD_H &= (uint8_t)(~EDIM_HDSL_PC_ADD_H_LRW);
    } else if(EDIM_HDSL_LONG_MSG_READ == mode) {
        EDIM_HDSL_PC_ADD_H |= (uint8_t)(EDIM_HDSL_PC_ADD_H_LRW);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure long message addressing direction mode (API_ID(0x001DU))
    \param[in]  mode: long message addressing direction mode
                EDIM_HDSL_LONG_MSG_DIRECT: long message direct addressing
                EDIM_HDSL_LONG_MSG_INDIRECT: long message indirect addressing
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_addr_direction_config(uint8_t mode)
{
    if(EDIM_HDSL_LONG_MSG_DIRECT == mode) {
        EDIM_HDSL_PC_ADD_H &= (uint8_t)(~EDIM_HDSL_PC_ADD_H_LIND);
    } else if(EDIM_HDSL_LONG_MSG_INDIRECT == mode) {
        EDIM_HDSL_PC_ADD_H |= (uint8_t)(EDIM_HDSL_PC_ADD_H_LIND);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure long message data length (API_ID(0x001EU))
    \param[in]  length: long message data length
                EDIM_HDSL_LONG_MSG_LEN_0: no data
                EDIM_HDSL_LONG_MSG_LEN_2: data length is 2 bytes
                EDIM_HDSL_LONG_MSG_LEN_4: data length is 4 bytes
                EDIM_HDSL_LONG_MSG_LEN_8: data length is 8 bytes
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_data_length_config(uint8_t length)
{
    EDIM_HDSL_PC_ADD_H &= (uint8_t)(~EDIM_HDSL_PC_ADD_H_LLEN);
    EDIM_HDSL_PC_ADD_H |= (uint8_t)(length & EDIM_HDSL_PC_ADD_H_LLEN);
}

/*!
    \brief      configure long message address (API_ID(0x001FU))
    \param[in]  laddh: long message address, bit 9 to bit 8
                laddl: long message address, bit 7 to bit 0
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_addr_config(uint8_t laddh, uint8_t laddl)
{
    EDIM_HDSL_PC_ADD_H &= (uint8_t)(~EDIM_HDSL_PC_ADD_H_LADDH);
    EDIM_HDSL_PC_ADD_H |= (uint8_t)(laddh & EDIM_HDSL_PC_ADD_H_LADDH);
    EDIM_HDSL_PC_ADD_L = laddl;
}

/*!
    \brief      configure long message address offset (API_ID(0x0020U))
    \param[in]  ladd_off_h: long message offset value, bit 14 to bit 8 
                ladd_off_l: long message offset value, bit 7 to bit 0
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_addr_offset_config(uint8_t ladd_off_h, uint8_t ladd_off_l)
{
    EDIM_HDSL_PC_OFF_H = (ladd_off_h | 0x80U);
    EDIM_HDSL_PC_OFF_L = ladd_off_l;
}

/*!
    \brief      start "long message" transaction (API_ID(0x0021U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_long_message_transaction_start(void)
{
    EDIM_HDSL_PC_CTRL |= (uint8_t)EDIM_HDSL_PC_CTRL_LSTA;
}

/*!
    \brief      get sensorhub channel flag (API_ID(0x0022U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SENSORHUB_FLAG_PSCI: Indication for special characters in the SensorHub Channel
      \arg        EDIM_HDSL_SENSORHUB_FLAG_PERR: Coding error of the bits in the SensorHub Channel
      \arg        EDIM_HDSL_SENSORHUB_FLAG_PEMP: The SensorHub channel buffer is empty
      \arg        EDIM_HDSL_SENSORHUB_FLAG_POVR: SensorHub Channel overflow

    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_sensorhub_channel_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_PIPE_S & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      read sensorhub channel data (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     8 bit value of the FIFO buffer for SensorHub Channel data: 0~0xFF
*/
uint8_t edim_hdsl_sensorhub_channel_data_read(void)
{
    return EDIM_HDSL_PIPE_D;
}

/*!
    \brief      read short message mirror data (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     8-bit value of the requested mirror register: 0~0xFF
*/
uint8_t edim_hdsl_short_message_mirror_data_read(void)
{
    return EDIM_HDSL_PC_DATA;
}

/*!
    \brief      read position error count (API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     5-bit value of count of transmitted fast position values with consecutive transmission errors: 0~0x1F
*/
uint8_t edim_hdsl_position_error_count_read(void)
{
    return (uint8_t)(EDIM_HDSL_ACC_ERR_CNT & EDIM_HDSL_ACC_ERR_CNT_CNT);
}

/*!
    \brief      configure fast position acceleration boundary (API_ID(0x0026U))
    \param[in]  mantissa: mantissa of fast position acceleration boundary, 0~0x3F, |accmax| = mantissa * resolution
    \param[in]  resolution: resolution of fast position acceleration boundary, 0~0x03
                EDIM_HDSL_MAXACC_RES_256: resolution is 256
                EDIM_HDSL_MAXACC_RES_64: resolution is 64
                EDIM_HDSL_MAXACC_RES_16: resolution is 16
                EDIM_HDSL_MAXACC_RES_4: resolution is 4
    \param[out] none
    \retval     none
*/
void edim_hdsl_fast_position_acc_boundary_config(uint8_t mantissa, uint8_t resolution)
{
    EDIM_HDSL_MAXACC = (uint8_t)(((uint8_t)(resolution << 6) & EDIM_HDSL_MAXACC_RES) | (uint8_t)(mantissa & EDIM_HDSL_MAXACC_MNT));
}

/*!
    \brief      configure fast position estimator deviation threshold (API_ID(0x0027U))
    \param[in]  threshold: estimator deviation threshold, 0~0xFFFF
    \param[out] none
    \retval     none
*/
void edim_hdsl_fast_position_estimator_deviation_threshold_config(uint16_t threshold)
{
    EDIM_HDSL_MAXDEV_L = (uint8_t)(threshold);
    EDIM_HDSL_MAXDEV_H = (uint8_t)(threshold >> 8);
}

/*!
    \brief      read fast position estimator deviation (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     max estimator deviation: 0~0xFFFF
*/
uint16_t edim_hdsl_fast_position_estimator_deviation_read(void)
{
    uint16_t reval = 0U;
    reval = EDIM_HDSL_MAXDEV_H;
    reval = (uint16_t)(EDIM_HDSL_MAXDEV_L | (uint16_t)(reval << 8));
    return reval;
}

/*!
    \brief      read dummy (API_ID(0x0029U))
    \param[in]  none
    \param[out] none
    \retval     dummy: 0~0xFF
*/
uint8_t edim_hdsl_dummy_read(void)
{
    return EDIM_HDSL_DUMMY;
}

/*!
    \brief      access slave mirror system errors, events, and warnings from the DSL encoder (API_ID(0x002AU))
    \param[in]  reg_idx: MIR_ST(reg_idx) need to be accessed, 0-7
    \param[out] none
    \retval     MIR_ST: 0~0xFF, this value is invalid
*/
uint8_t edim_hdsl_mirror_status_flag_access(uint8_t reg_idx)
{
    return EDIM_HDSL_MIR_ST(reg_idx);
}

/*!
    \brief      clear slave mirror system errors, events, and warnings from the DSL encoder (API_ID(0x002BU))
    \param[in]  reg_idx: MIR_ST(reg_idx) need to be cleared, 0-7
    \param[out] none
    \retval     none
*/
void edim_hdsl_mirror_status_flag_clear(uint8_t reg_idx)
{
    EDIM_HDSL_MIR_ST(reg_idx) &= (uint8_t)(~EDIM_HDSL_MIR_ST_MIRST);
}

/*!
    \brief      get edges in safe channel 1 cable signal (API_ID(0x002CU))
    \param[in]  none
    \param[out] none
    \retval     identification of edges in the cable signal: 0~0x0F
*/
uint8_t edim_hdsl_safe_channel1_cable_signal_edge_get(void)
{
    return EDIM_HDSL_SAFE_EDGES;
}

/*!
    \brief      get safe channel 1 cable delay (API_ID(0x002DU))
    \param[in]  none
    \param[out] none
    \retval     4-bit value for cable delay: 0~0x09
*/
uint8_t edim_hdsl_safe_channel1_cable_delay_get(void)
{
    return (uint8_t)(EDIM_HDSL_SAFE_DELAY & EDIM_HDSL_DELAY_CBLDLY);
}

/*!
    \brief      get received safe channel 1 signal strength (API_ID(0x002EU))
    \param[in]  none
    \param[out] none
    \retval     4-bit value for received signal strength: 0~0x0C
*/
uint8_t edim_hdsl_received_safe_channel1_signal_strength_get(void)
{
    return (uint8_t)((EDIM_HDSL_SAFE_DELAY & EDIM_HDSL_DELAY_RSSI) >> 4);
}


/*!
    \brief      safe channel 1 version information (API_ID(0x002FU))
    \param[in]  none
    \param[out] none
    \retval     version number: 0~0xFF
*/
uint8_t edim_hdsl_safe_channel1_version_get(void)
{
    return EDIM_HDSL_SAFE_VERSION;
}

/*!
    \brief      get safe channel 1 encoder id information (API_ID(0x0030U))
    \param[in]  none
    \param[out] none
    \retval     encoder id: 0~0xFFFFFFFF
*/
uint32_t edim_hdsl_safe_channel1_encoder_id_get(void)
{
    uint32_t enc_id;
    /* get Encoder ID */
    enc_id = EDIM_HDSL_SAFE_ENC_ID2 & 0x7FU;
    enc_id = EDIM_HDSL_SAFE_ENC_ID1 | (uint32_t)(enc_id << 8U);
    enc_id = EDIM_HDSL_SAFE_ENC_ID0 | (uint32_t)(enc_id << 8U);
    return enc_id;
}

/*!
    \brief      read safe channel 1 position crc (API_ID(0x0031U))
    \param[in]  none
    \param[out] none
    \retval     crc of the safe channel 1: 0~0xFFFF
*/
uint16_t edim_hdsl_safe_channel1_position_crc_read(void)
{
    uint16_t crc;
    /* get Encoder ID */
    crc = (uint16_t)EDIM_HDSL_VPOSCRC_H;
    crc = (uint16_t)EDIM_HDSL_VPOSCRC_L | (uint16_t)(crc << 8);
    return crc;
}

/*!
    \brief      reset message for the safety-related application (API_ID(0x0032U))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_message_reset(ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        EDIM_HDSL_SAFE_CTRL |= (uint8_t)EDIM_HDSL_SAFE_CTRL_MRST;
    } else {
        EDIM_HDSL_SAFE_CTRL &= (uint8_t)(~EDIM_HDSL_SAFE_CTRL_MRST);
    }
}

/*!
    \brief      reset protocol status for the safety-related application (API_ID(0x0033U))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_protocol_reset(ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        EDIM_HDSL_SAFE_CTRL |= (uint8_t)EDIM_HDSL_SAFE_CTRL_PRST;
    } else {
        EDIM_HDSL_SAFE_CTRL &= (uint8_t)(~EDIM_HDSL_SAFE_CTRL_PRST);
    }
}

/*!
    \brief      get safe status summary flag (API_ID(0x0034U))
    \param[in]  none
    \param[out] none
    \retval     Status summary flag: 0~0xFF
*/
uint8_t edim_hdsl_safe_status_sum_flag_get(void)
{
    return EDIM_HDSL_SAFE_SUM;
}

/*!
    \brief      read parameter channel short message (API_ID(0x0035U))
    \param[in]  none
    \param[out] none
    \retval     short message: 0~0xFF
*/
uint8_t edim_hdsl_short_message_read(void)
{
    return EDIM_HDSL_S_PC_DATA;
}

/*!
    \brief      access slave system errors, events, and warnings from the DSL encoder (API_ID(0x0036U))
    \param[in]  reg_idx: ENC_ST(reg_idx) need to be accessed, 0-7
    \param[out] none
    \retval     ENC_ST: 0~0xFF, this value is invalid
*/
uint8_t edim_hdsl_encoder_status_flag_access(uint8_t reg_idx)
{
    return EDIM_HDSL_ENC_ST(reg_idx);
}

/*!
    \brief      clear slave system errors, events, and warnings from the DSL encoder (API_ID(0x0037U))
    \param[in]  reg_idx: ENC_ST(reg_idx) need to be cleared, 0-7
    \param[out] none
    \retval     none
*/
void edim_hdsl_encoder_status_flag_clear(uint8_t reg_idx)
{
    EDIM_HDSL_ENC_ST(reg_idx) &= (uint8_t)(~EDIM_HDSL_ENC_ST_ENCST);
}

/*!
    \brief      read slave RSSI (API_ID(0x0038U))
    \param[in]  none
    \param[out] none
    \retval     slave rssi: 0~0x07
*/
uint8_t edim_hdsl_slave_rssi_read(void)
{
    return (EDIM_HDSL_SRSSI & 0x07U);
}

/*!
    \brief      configure slave mail (API_ID(0x0039U))
    \param[in]  mail: slave mail, 0~0xFF
    \param[out] none
    \retval     none
*/
void edim_hdsl_slave_mail_config(uint8_t mail)
{
    EDIM_HDSL_MAIL = mail;
}

/*!
    \brief      configure slave ping (API_ID(0x003AU))
    \param[in]  ping: slave ping, 0~0xFF
    \param[out] none
    \retval     none
*/
void edim_hdsl_slave_ping_write(uint8_t ping)
{
    EDIM_HDSL_PING = ping;
}

/*!
    \brief      read slave ping (API_ID(0x003BU))
    \param[in]  none
    \param[out] none
    \retval     ping: 0~0xFF
*/
uint8_t edim_hdsl_slave_ping_read(void)
{
    uint8_t ping = 0U;
    ping = EDIM_HDSL_PING;
    return ping;
}

/*!
    \brief      get safe channel 2 version information (API_ID(0x003CU))
    \param[in]  none
    \param[out] none
    \retval     version number: 0~0xFF
*/
uint8_t edim_hdsl_safe_channel2_version_get(void)
{
    return EDIM_HDSL_VERSION2;
}

/*!
    \brief      safe channel 2 version information (API_ID(0x003DU))
    \param[in]  none
    \param[out] none
    \retval     designation of the safe channel 2 channel: 0~0xFF
*/
uint8_t edim_hdsl_safe_channel2_encoder_id_get(void)
{
    return EDIM_HDSL_ENC2_ID;
}

/*!
    \brief      read EDIM_HDSL safe channel 2 fixed bit pattern (API_ID(0x003EU))
    \param[in]  none
    \param[out] none
    \retval     fixed bit pattern: 0~0x1F
*/
uint8_t edim_hdsl_safe_channel2_fix_bit_read(void)
{
    return (uint8_t)(EDIM_HDSL_STATUS2 & EDIM_HDSL_STATUS2_FIX2);
}

/*!
    \brief      read safe channel 2 position crc (API_ID(0x003FU))
    \param[in]  none
    \param[out] none
    \retval     crc of the safe channel 2: 0~0xFFFF
*/
uint16_t edim_hdsl_safe_channel2_position_crc_read(void)
{
    uint16_t crc;
    /* get Encoder ID */
    crc = (uint16_t)EDIM_HDSL_VPOSCRC2_H;
    crc = (uint16_t)EDIM_HDSL_VPOSCRC2_L | (uint16_t)(crc << 8);
    return crc;
}

/*!
    \brief      read dummy2 (API_ID(0x0040U))
    \param[in]  none
    \param[out] none
    \retval     dummy2: 0~0xFF
*/
uint8_t edim_hdsl_dummy2_read(void)
{
    return EDIM_HDSL_DUMMY2;
}

/*!
    \brief      configure hdsl unit0 endian mode (API_ID(0x0041U))
    \param[in]  mode: endian mode
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_ENDIAN_MODE_BIG: big endian
      \arg        EDIM_HDSL_ENDIAN_MODE_LITTLE: little endian
    \param[out] none
    \retval     none
*/
void edim_hdsl_endian_mode_config(uint8_t mode)
{
    if(EDIM_HDSL_ENDIAN_MODE_BIG == mode) {
        EDIM_HDSL_CTL &= (~(EDIM_HDSL_CTL_ENDIAN));
    } else if(EDIM_HDSL_ENDIAN_MODE_LITTLE == mode) {
        EDIM_HDSL_CTL |= EDIM_HDSL_CTL_ENDIAN;
    } else {

