wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_edim_hdsl.c
}

/*!
    \brief      clear EDIM_HDSL flag (API_ID(0x0050U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_FLAG_PRST: Protocol reset warning
      \arg        EDIM_HDSL_FLAG_DTE: Estimator deviation threshold error
      \arg        EDIM_HDSL_FLAG_POS: Estimator turned on
      \arg        EDIM_HDSL_FLAG_SUM: Remote event monitoring
      \arg        EDIM_HDSL_FLAG_FREL: Channel free for "long message"
      \arg        EDIM_HDSL_FLAG_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_FLAG_MIN: Message initialization
    \param[out] none
    \retval     none
*/
void edim_hdsl_flag_clear(uint32_t flag)
{
    if((flag & 0xFFU) != 0U) {
        EDIM_HDSL_EVENT_L &= (uint8_t)(~(flag & EDIM_HDSL_FLAG_MASK));
    } else {
        EDIM_HDSL_EVENT_H &= (uint8_t)(~((flag & EDIM_HDSL_FLAG_MASK) >> 8));
    }
}

/*!
    \brief      enable EDIM_HDSL interrupt (API_ID(0x0051U))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_INT_PRST: Protocol reset warning
      \arg        EDIM_HDSL_INT_DTE: Estimator deviation threshold error
      \arg        EDIM_HDSL_INT_POS: Estimator turned on
      \arg        EDIM_HDSL_INT_SUM: Remote event monitoring
      \arg        EDIM_HDSL_INT_FREL: Channel free for "long message"
      \arg        EDIM_HDSL_INT_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_INT_ANS: Erroneous answer to "long message"
      \arg        EDIM_HDSL_INT_MIN: Message initialization
    \param[out] none
    \retval     none
*/
void edim_hdsl_interrupt_enable(uint32_t interrupt)
{
    if((interrupt & 0xFFU) != 0U) {
        EDIM_HDSL_MASK_L |= (uint8_t)(interrupt & EDIM_HDSL_INTEN_MASK);
    } else {
        EDIM_HDSL_MASK_H |= (uint8_t)((interrupt & EDIM_HDSL_INTEN_MASK) >> 8);
    }
}

/*!
    \brief      disable EDIM_HDSL interrupt (API_ID(0x0052U))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_INT_PRST: Protocol reset warning
      \arg        EDIM_HDSL_INT_DTE: Estimator deviation threshold error
      \arg        EDIM_HDSL_INT_POS: Estimator turned on
      \arg        EDIM_HDSL_INT_SUM: Remote event monitoring
      \arg        EDIM_HDSL_INT_FREL: Channel free for "long message"
      \arg        EDIM_HDSL_INT_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_INT_ANS: Erroneous answer to "long message"
      \arg        EDIM_HDSL_INT_MIN: Message initialization
    \param[out] none
    \retval     none
*/
void edim_hdsl_interrupt_disable(uint32_t interrupt)
{
    if((interrupt & 0xFFU) != 0U) {
        EDIM_HDSL_MASK_L &= (uint8_t)(~(interrupt & EDIM_HDSL_INTEN_MASK));
    } else {
        EDIM_HDSL_MASK_H &= (uint8_t)(~((interrupt & EDIM_HDSL_INTEN_MASK) >> 8));
    }
}

/*!
    \brief      enable mirror sum bit set the sum event monitoring in the EVENT_H register and the interrupt signal (API_ID(0x0053U))
    \param[in]  flag: mirror sum event
                one and more parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_MASK_SUM_0: Mask for status summary bit 0
      \arg        EDIM_HDSL_MASK_SUN_1: Mask for status summary bit 1
      \arg        EDIM_HDSL_MASK_SUM_2: Mask for status summary bit 2
      \arg        EDIM_HDSL_MASK_SUN_3: Mask for status summary bit 3
      \arg        EDIM_HDSL_MASK_SUM_4: Mask for status summary bit 4
      \arg        EDIM_HDSL_MASK_SUN_5: Mask for status summary bit 5
      \arg        EDIM_HDSL_MASK_SUM_6: Mask for status summary bit 6
      \arg        EDIM_HDSL_MASK_SUN_7: Mask for status summary bit 7
    \param[out] none
    \retval     none
*/
void edim_hdsl_mir_sum_event_enable(uint32_t flag)
{
    EDIM_HDSL_MASK_SUM |= (uint8_t)flag;
}

/*!
    \brief      disable mirror sum bit set the sum event monitoring in the EVENT_H register and the interrupt signal (API_ID(0x0054U))
    \param[in]  flag: mirror sum event
                one and more parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_MASK_SUM_0: Mask for status summary bit 0
      \arg        EDIM_HDSL_MASK_SUN_1: Mask for status summary bit 1
      \arg        EDIM_HDSL_MASK_SUM_2: Mask for status summary bit 2
      \arg        EDIM_HDSL_MASK_SUN_3: Mask for status summary bit 3
      \arg        EDIM_HDSL_MASK_SUM_4: Mask for status summary bit 4
      \arg        EDIM_HDSL_MASK_SUN_5: Mask for status summary bit 5
      \arg        EDIM_HDSL_MASK_SUM_6: Mask for status summary bit 6
      \arg        EDIM_HDSL_MASK_SUN_7: Mask for status summary bit 7
    \param[out] none
    \retval     none
*/
void edim_hdsl_mir_sum_event_disable(uint32_t flag)
{
    EDIM_HDSL_MASK_SUM &= (uint8_t)(~flag);
}

/*!
    \brief      get EDIM_HDSL interrupt event flag (API_ID(0x0055U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_INT_FLAG_PRST: Protocol reset warning
      \arg        EDIM_HDSL_INT_FLAG_DTE: Estimator deviation threshold error
      \arg        EDIM_HDSL_INT_FLAG_POS: Estimator turned on
      \arg        EDIM_HDSL_INT_FLAG_SUM: Remote event monitoring
      \arg        EDIM_HDSL_INT_FLAG_FREL: Channel free for "long message"
      \arg        EDIM_HDSL_INT_FLAG_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_INT_FLAG_ANS: Erroneous answer to "long message"
      \arg        EDIM_HDSL_INT_FLAG_MIN: Message initialization
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_interrupt_flag_get(uint32_t flag)
{
    uint32_t val1 = 0U;
    uint32_t reg_tmp1 = 0U;
    FlagStatus reval;
    reg_tmp1 = (uint32_t)EDIM_HDSL_EVENT_L;
    reg_tmp1 |= (((uint32_t)EDIM_HDSL_EVENT_H) << 8U);
    val1 = reg_tmp1 & flag;
    if(RESET != val1) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear EDIM_HDSL interrupt event flag (API_ID(0x0056U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_INT_FLAG_PRST: Protocol reset warning
      \arg        EDIM_HDSL_INT_FLAG_DTE: Estimator deviation threshold error
      \arg        EDIM_HDSL_INT_FLAG_POS: Estimator turned on
      \arg        EDIM_HDSL_INT_FLAG_SUM: Remote event monitoring
      \arg        EDIM_HDSL_INT_FLAG_FREL: Channel free for "long message"
      \arg        EDIM_HDSL_INT_FLAG_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_INT_FLAG_ANS: Erroneous answer to "long message"
      \arg        EDIM_HDSL_INT_FLAG_MIN: Message initialization
    \param[out] none
    \retval     none
*/
void edim_hdsl_interrupt_flag_clear(uint32_t flag)
{
    if((flag & 0xFFU) != 0U) {
        EDIM_HDSL_EVENT_L &= (uint8_t)(~(flag & EDIM_HDSL_INT_FLAG_MASK));
    } else {
        EDIM_HDSL_EVENT_H &= (uint8_t)(~((flag & EDIM_HDSL_INT_FLAG_MASK) >> 8));
    }
}

/*!
    \brief      get EDIM_HDSL safe channel 1 event flag (API_ID(0x0057U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_FLAG_FRES: Channel free for "short message"
      \arg        EDIM_HDSL_SAFE_FLAG_MIN: Message init
      \arg        EDIM_HDSL_SAFE_FLAG_PRST: Protocol reset warning
      \arg        EDIM_HDSL_SAFE_FLAG_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_FLAG_VPOS: Safe position error
      \arg        EDIM_HDSL_SAFE_FLAG_SCE: Error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_FLAG_SSUM: Remote event monitoring
      \arg        EDIM_HDSL_SAFE_FLAG_SINT: Safe interrupt status
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_safe_channel1_flag_get(uint8_t flag)
{
    uint8_t status_reg;
    FlagStatus reval;
    status_reg = EDIM_HDSL_EVENT_S;

    if(RESET != (status_reg & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;

