wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_edim_hdsl.c
}

/*!
    \brief      clear EDIM_HDSL safe channel 1 event flag (API_ID(0x0058U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_FLAG_FRES: Channel free for "short message"
      \arg        EDIM_HDSL_SAFE_FLAG_MIN: Message init
      \arg        EDIM_HDSL_SAFE_FLAG_PRST: Protocol reset warning
      \arg        EDIM_HDSL_SAFE_FLAG_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_FLAG_VPOS: Safe position error
      \arg        EDIM_HDSL_SAFE_FLAG_SCE: Error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_FLAG_SSUM: Remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_flag_clear(uint8_t flag)
{
    EDIM_HDSL_EVENT_S &= ((uint8_t)(~((uint32_t)flag & (uint32_t)EDIM_HDSL_EVENT_S_MASK)));
}

/*!
    \brief      enable EDIM_HDSL safe channel 1 interrupt (API_ID(0x0059U))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FRES: Interrupt enable for channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_MIN:  Interrupt enable for message init
      \arg        EDIM_HDSL_SAFE_INT_PRST: Interrupt enable for protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_QMLW: Interrupt enable for quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_VPOS: Interrupt enable for safe position error
      \arg        EDIM_HDSL_SAFE_INT_SCE:  Interrupt enable for error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_SSUM: Interrupt enable for remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_interrupt_enable(uint8_t interrupt)
{
    EDIM_HDSL_MASK_S |= interrupt;
}

/*!
    \brief      disable EDIM_HDSL safe channel 1 interrupt (API_ID(0x005AU))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FRES: Interrupt enable for channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_MIN:  Interrupt enable for message init
      \arg        EDIM_HDSL_SAFE_INT_PRST: Interrupt enable for protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_QMLW: Interrupt enable for quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_VPOS: Interrupt enable for safe position error
      \arg        EDIM_HDSL_SAFE_INT_SCE:  Interrupt enable for error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_SSUM: Interrupt enable for remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_interrupt_disable(uint8_t interrupt)
{
    EDIM_HDSL_MASK_S &= ((uint8_t)(~(uint32_t)interrupt));
}

/*!
    \brief      get EDIM_HDSL safe channel 1 interrupt event flag (API_ID(0x005BU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FLAG_FRES: Channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_FLAG_MIN: Message init
      \arg        EDIM_HDSL_SAFE_INT_FLAG_PRST: Protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_VPOS: Safe position error
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SCE: Error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SSUM: Remote event monitoring
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_safe_channel1_interrupt_flag_get(uint8_t flag)
{
    FlagStatus reval;
    if(RESET != (EDIM_HDSL_EVENT_S & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear EDIM_HDSL safe channel 1 event flag (API_ID(0x005CU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FLAG_FRES: Channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_FLAG_MIN: Message init
      \arg        EDIM_HDSL_SAFE_INT_FLAG_PRST: Protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_QMLW: Quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_VPOS: Safe position error
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SCE: Error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SSUM: Remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_interrupt_flag_clear(uint8_t flag)
{
    EDIM_HDSL_EVENT_S &= ((uint8_t)(~((uint32_t)flag & (uint32_t)EDIM_HDSL_EVENT_S_MASK)));
}

/*!
    \brief      get EDIM_HDSL safe channel 2 flag (API_ID(0x005DU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE2_FLAG_ERR: Safe Channel 2 Position Error
      \arg        EDIM_HDSL_SAFE2_FLAG_TEST: Safe Channel 2 Test
      \arg        EDIM_HDSL_SAFE2_FLAG_TOG: Safe Channel 2 Toggle
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_safe_channel2_flag_get(uint8_t flag)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_STATUS2 & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}
